app/views/users/show.html.erb

<p>Groups:
	<% @user.groups.each do |g| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "manifests" ON "groups"."id" = "manifests"."group_id" WHERE "manifests"."user_id" = ?  [["user_id", 2]]