app/views/location/show.html.erb

<br>
<% Group.all.each do |g| %>
---
SELECT "groups".* FROM "groups"  WHERE "groups"."location_id" = ?  [[nil, 4]]