app/views/group/index.html.erb

SELECT "groups".* FROM "groups"
---

<% Group.all.each do |group| %>