app/controllers/group_controller.rb

INSERT INTO "groups" ("created_at", "location", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-04-28 22:57:09.632003"], ["location", "Crossroads"], ["name", "CS61B"], ["updated_at", "2015-04-28 22:57:09.632003"]]
---
	def create
    	@group = Group.create(group_params)

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 3]]
---
	def show
		 @groups = Group.find(params[:id])

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 3]]
---
	def join
		@group = Group.find(params[:id])