app/controllers/groups_controller.rb

	def create
    	@group = Group.create(group_params)
    	@locName = group_params[:location]
    	@actualLoc = Location.find_by name: @locName
    	@group.location_id = @actualLoc.id
    	if @group.save
---
INSERT INTO "groups" ("created_at", "description", "location", "name", "time", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2015-04-30 05:14:25.178789"], ["description", "yay"], ["location", "Foothill"], ["name", "Yay2"], ["time", "This Friday 5:00pm"], ["updated_at", "2015-04-30 05:14:25.178789"]]
SELECT  "locations".* FROM "locations"  WHERE "locations"."name" = 'Crossroads' LIMIT 1
UPDATE "groups" SET "location_id" = ?, "updated_at" = ? WHERE "groups"."id" = 16  [["location_id", 4], ["updated_at", "2015-04-30 05:28:14.142821"]]

	def index
		@group = Group.all
---
SELECT "groups".* FROM "groups"