app/controllers/location_controller.rb

SELECT  "locations".* FROM "locations"  WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		 @locations = Location.find(params[:id])