app/controllers/users_controller.rb

SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 1]]
SELECT  1 AS one FROM "groups" INNER JOIN "manifests" ON "groups"."id" = "manifests"."group_id" WHERE "manifests"."user_id" = ? AND "groups"."id" = 4 LIMIT 1  [["user_id", 2]]
---
    def join
      @group = Group.find(params[:id])
      @user = current_user
      if @user.groups.include?(@group)