app/controllers/user_controller.rb

  	def join
		@group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups"  WHERE "groups"."id" = ? LIMIT 1  [["id", 4]]