app/views/locations/index.html.erb

SELECT "locations".* FROM "locations"
---
    <!-- normal -->
    <% Location.all.each do |location| %>