app/views/locations/show.html.erb

SELECT "groups".* FROM "groups"
---
	</tr>
	<% @sorted_groups = Group.all.sort_by {|g| Chronic.parse(g.time)} %>